# Написать программу, которая принимает на вход два целых числа и проверяет, является ли одно число квадратом другого.
# Примеры
# 5, 25 -> да
# 4, 16 -> да
# 25, 5 -> да
# 8,9 -> нет
import math

ex1
a = int(input('a = '))
b = int(input('b = '))

if int(a ** 2) == int(b):
    print('yes')
else:
    print('no')
